<center><h1>BD2P3 - MACHINE LEARNING LAB</h1></center>
<center><h3>21BDA18</h3></center>

In [2]:
for i in range(5):
    print(i**2)

0
1
4
9
16

In [3]:
marks = [78,80,54,65,90]
for i in range(len(marks)):
    print(marks[i])

78
80
54
65
90

In [4]:
for mark in marks:
    print (mark)

78
80
54
65
90

In [5]:
pass_mark=28
for mark in marks:
    if mark<pass_mark and mark>20:
        print("Grace Marks Awarded")
    elif mark<pass_mark:
        print("Fail")
    else:
        print("Pass")
print("_____________________________")

Pass
Pass
Pass
Pass
Pass
_____________________________

In [7]:
l1 = list("RAINBOW")
l1

['R', 'A', 'I', 'N', 'B', 'O', 'W']

In [8]:
def sum_of(a,b):
    return(a+b)
sum_of(23,56)

79

In [9]:
def diff_of(fno=0,sco=0):
    return(fno-sco)

In [10]:
import pandas as pd
marks_series=pd.Series([45,12,34,87,23,78])

In [11]:
marks_series.index

RangeIndex(start=0, stop=6, step=1)

In [12]:
marks_series.values

array([45, 12, 34, 87, 23, 78], dtype=int64)

In [ ]:
marks_series[1:]

In [13]:
#Can be changed
marks_series[5:]=45
marks_series

0    45
1    12
2    34
3    87
4    23
5    45
dtype: int64

In [14]:
df1 = pd.DataFrame(marks)
df1

    0
0  78
1  80
2  54
3  65
4  90

In [15]:
df1.columns=['Marks']
df1

   Marks
0     78
1     80
2     54
3     65
4     90

In [25]:
print(df1.T)

        0   1   2   3   4
Marks  78  80  54  65  90

In [18]:
#Shift + Tab = Docstring 
df2 = pd.read_excel(r"C:\Users\ahmed\Downloads\advertising (4).xlsx")
df2.head(10)

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3   12.0
3  151.5   41.3       58.5   16.5
4  180.8   10.8       58.4   17.9
5    8.7   48.9       75.0    7.2
6   57.5   32.8       23.5   11.8
7  120.2   19.6       11.6   13.2
8    8.6    2.1        1.0    4.8
9  199.8    2.6       21.2   15.6

In [21]:
df2.shape

(200, 4)

In [23]:
df2.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   15.130500
std     85.854236   14.846809   21.778621    5.283892
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   11.000000
50%    149.750000   22.900000   25.750000   16.000000
75%    218.825000   36.525000   45.100000   19.050000
max    296.400000   49.600000  114.000000   27.000000

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   Radio      200 non-null    float64
 2   Newspaper  200 non-null    float64
 3   Sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [19]:
df2.isna().sum()

TV           0
Radio        0
Newspaper    0
Sales        0
dtype: int64

In [24]:
df2.corr()

                 TV     Radio  Newspaper     Sales
TV         1.000000  0.054809   0.056648  0.901208
Radio      0.054809  1.000000   0.354104  0.349631
Newspaper  0.056648  0.354104   1.000000  0.157960
Sales      0.901208  0.349631   0.157960  1.000000